[
    {
        "title": "Baba Ganush 1",
        "ingredients": "1 eggplant\n1/4 cup tahini\n2 cloves garlic\n1/4 cup lemon juice\n1/2 tsp cumin\n1/4 tsp sea salt\n\nOptional Garnish:\n1 tsp olive oil\npinch of paprika\nparsley",
        "instructions": "Preheat your oven to 400F/205C. Take your eggplant and cut it in half, then place on a parchment lined baking sheet. Prick holes through the skin of the eggplant with a fork.  Once the oven is up to temp, go ahead and pop the eggplant in for approx. 30 minutes.  Once cooked, let the eggplant cool for a few minutes until you can handle it comfortably, and peel off the skin.  The skin should come off really easily at this point.\nCombine the cooked eggplant flesh and the remainder of ingredients into a blender, and pulse until nice and uniform.  Garnish with olive oil, paprika and parsley.",
        "img": "blah.jpg"
    },
    {
        "title": "Creme Brulee",
        "ingredients": "Custard:\n6 egg yolks\n2 tbsp Truvia\n1/2 tsp vanilla extract\n2 1/2 cups heavy whipping cream\n\nCarmelized Topping (optional):\n1/2 tsp sugar\n1/4 tsp cinnamon\n1 tsp Truvia",
        "instructions": "Separate egg yolks in a bowl and add the Truvia and vanilla extract - give it all a nice brisk wisk until uniform and a bit creamy.  Add the heavy cream to a saucepan and heat to just about boiling, and remove from heat.  Pour a little of the hot cream into the egg yolk mixture, and again, give it all a good whisking'.  Now take the yolk mixture and slowly pour it into the rest of hot cream, whisking while you pour.  The mixture will develop some foam, be sure to scoop it out with a spoon or a sieve. \nNow pour the mixture into individual ramekins or other suitable dishes (oven-safe).  This recipe yields about 4-6 servings depending on how generous you are.  Now place the ramekins into a baking dish and pour hot water into the baking dish, about half way up the sides of your ramekins.  Pop them in the oven at 350F/175C for about 20-30 minutes - they're done when they have a good jiggle to them.  Remove from oven and let them cool at room temp in the water bath for about 20 minutes.  Next toss them in the fridge to chill out - they need at least 2 hours to set-up nicely and can be left overnight.\nNow we're almost there.  The best part of a good crème brûlée is the contrasting crispiness of the caramelized top and the velvety smoothness of the underlying custard.  Problem is most keto friendly sugar alcohols don't caramelize - they melt.  So to really get that crunch on top, you need to employ a little bit of our arch-nemesis - sugar.  Now don't panic, using only a half teaspoon across 4 servings only amounts to about 0.5g of resultant carbs.  Phew, let's move on.\nCombine the sugar, cinnamon and Truvia until uniform, and sprinkle evenly over the chilled custards.  If you have a kitchen torch, extra fancy points, torch the top for a few minutes until well caramelized.  No torch, no stress.  Throwing them under the broiler for 2-5 minutes also does the trick.  Serve immediately, you keto rock-star-you.",
        "img": "blah.jpg"
    },
    {
        "title": "Keto Pancakes",
        "ingredients": "1 cup almond flour\n2 eggs\n1/4 cup soda water\n2 tbsp coconut oil\n1/4 tsp salt\n1/4 vanilla extract\n2 tbsp erythritol\n\nOptional Toppings:\nWhipped Cream\nBerries\nSugar-free pancake syrup\nGrated 85% Lindt Dark Chocolate",
        "instructions": "There ain't much science to this one folks, get a large bowl and add the ingredients one by one.  With the coconut oil, make sure you liquify before adding it to the mix.  No coconut oil? No biggie, any cooking oil should get results.  Get your mix on with a whisk until everything is blended and homogenous - too runny? Add some more almond flour. Too thick, go ahead and splash in some more soda.  Almond flour consistency is variable from batch to batch and brand to brand, so some tinkering is usually required here.\nGet your griddle or pan up to approx 375F or 200C, and cook these as you would normal pancakes.  Keep a close eye for bubbles, depending on how thick your batch is, bubbles may not be as prominent as your traditional pancake batter.\nI think you guys can take it from here - pop these keto pancakes off the griddle and top to your liking.  I like to go with a little whipped cream, strawberries, sugar-free pancake syrup, and finish it all off with some chocolate zest from a 85% Lindt Chocolate square.  Enjoy! ",
        "img": "blah.jpg"
    }
]